# №17680
# https://kompege.ru/task

# В файле содержится последовательность целых чисел. 
# Её элементы могут принимать целые значения 
# от –100 000 до 100 000 включительно. 
# Определите количество пар последовательности, 
# в которых элементы не равны, а абсолютное значение 
# их разности делится на минимальный положительный 
# элемент последовательности, кратный 41. 
# Гарантируется, что такой элемент в последовательности есть. 
# В ответе запишите количество найденных пар, 
# затем максимальную из сумм элементов таких пар. 
# В данной задаче под парой подразумевается 
# два идущих подряд элемента последовательности.

# Ответ: 10 92404

